In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("L01_Working_with_pandas_data.csv")

In [3]:
df

   sample_num First_name Last_name  Age  Weight_before  Weight_after
0           1      Jason    Miller   42            108            85
1           2      Molly  Jacobson   52             99            84
2           3       Tina         ?   36            134            67
3           4       Jake    Milner   24            112            62
4           5        Amy     Cooze   73             95            74
5           6     Joshua     Dylan   25             71            72
6           7     Daniel    Wilson   53             94            92
7           8      Nancy      King   37             85            73
8           9       Ross     Evans   63             79            76
9          10      Miles      Bark   39            102            96

In [4]:
df.head(2)

   sample_num First_name Last_name  Age  Weight_before  Weight_after
0           1      Jason    Miller   42            108            85
1           2      Molly  Jacobson   52             99            84

In [5]:
df["Age"]

0    42
1    52
2    36
3    24
4    73
5    25
6    53
7    37
8    63
9    39
Name: Age, dtype: int64

In [12]:
df.iloc[2:4,1:4]

  First_name Last_name  Age
2       Tina         ?   36
3       Jake    Milner   24

In [ ]:
df.iloc[2,